Repository: Devin-YU/I18N-Gettext-Supported
Catalog: I18NTest_xCode5/res/*.po
Languages: ru

source: Hello world!
ru: Здравствуйте, мир!

# A post.
source: post
ru: сообщение

# To post.
source: post
ru: публиковать

source: There is a comment.
ru: Есть комментарии.

# male
source: This apple belongs to them.
ru: Это яблоко принадлежит им.

# female
source: This apple belongs to them.
ru: Это яблоко принадлежит им.

# animal
source: This apple belongs to them.
ru: Это яблоко принадлежит им.

source: hero
ru: герой

source: book
ru: книга

source: child
ru: ребёнок

source: knife
ru: нож

source: mouse
ru: мышь

# male
source: he
ru: он

# female
source: she
ru: она

# object
source: it
ru: оно

source: i=%d1 is %8s2:
ru: i=%d1 Да %14s2:

source: singular
ru: единственном

source: plural
ru: множественное

source: i=%d is %8s:
ru: i=%d Да %14s:

source: You have chosen the %s1 hat.
ru: Вы выбираете %s1 шляпу.

source: red
ru: красную

source: blue
ru: синюю

source: yellow
ru: жёлтую

source: Hi %s1! Welcome to %s1's city.
ru: Здравствуйте %s1! Добро пожаловать в %s1 города.

source: There are birds %s1 in the %s2.
ru: Птицы %s1 песни на %s2.

source: singing
ru: поют

source: tree
ru: деревьях
